In [1]:
import sqlite3

In [2]:
db = sqlite3.connect('School.sqlite')
db

In [3]:
cur = db.cursor()
cur

In [4]:
sql_query = 'create table Student(RollNumber int primary key, Name Text, Age int)'
cur.execute(sql_query)

In [5]:
cur.execute('Insert into Student values(101, "Aman",20)')
db.commit()

db.close()
cur.execute('Insert into Student values(101, "Aman",20)') # Gives error bcz database connection is closed
db.commit()

In [6]:
db = sqlite3.connect('School.sqlite')
cur = db.cursor()
cur.execute('Insert into Student values(102, "Mohit",24)')
db.commit()

### Passing query parameters

In [7]:
rollNumber = 104
Name = 'Nikhil'
age = 34

cur.execute('Insert into student values(?, ?, ?)', (rollNumber, Name, age))
db.commit()

### execute many

In [8]:
values = [(105, 'Nidhi', 20), (106,'Manisha',21), (107,'Ankush',22)]
cur.executemany('Insert into student values(?,?,?)',values)
db.commit()

### Update

In [9]:
cur.execute('update Student set Age=30')

In [10]:
cur.execute('update Student set Age=25 where rollnumber=102')
db.commit()

In [11]:
new_age = 50
cur.execute('update Student set Age=? where rollnumber=104',(new_age,))
db.commit()

In [12]:
db.close()

### Create an Employee SQLite Database for Investment Firm and in that Database create EmployeeDetail table with columns names employeeid(Primary Key), name, age, department, and salary. Now add the value in Employee_Detail table of given employee

In [13]:
import sqlite3
db = sqlite3.connect('Employee.sqlite')
cur = db.cursor()

In [14]:
cur.execute('create table EmployeeDetail(employeeid int primary key, name Text, age int, department Text, salary int)')

In [15]:
values = [(100, 'Rishav', 25, 'Marketing', 50000), (101, 'Abhishek', 26, 'Operations', 60000), (102, 'Aman', 24, 'Human Resource', 75000) ]
cur.executemany('Insert into employeedetail values(?,?,?,?,?)', values)
db.commit()

### From Employee SQLite Database remove the Employee with employee_id 101?(Without Using Parameter)

In [16]:
cur.execute('delete from employeedetail where employeeid=101')
db.commit()

### From Employee SQLite Database remove the Employee with employeeid 102?(Using Parameter i.e storing employeeid in variable and then executing the SQL query)

In [17]:
empid = 102
cur.execute('delete from employeedetail where employeeid=?', (empid,))
db.commit()

### From Employee SQLite Database remove the Employee with employeeid 100

In [18]:
cur.execute('delete from employeedetail where employeeid=100')
db.commit()

### A given data of 12 Employees working in an investment firm. So add the Employee Data in Employee SQLite Database of Employee_Detail Table which was created by you.

In [19]:
employee_id=[101,102,103,104,105,106,107,108,109,110,111,112,113]
name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
age=[25,27,25,24,30,26,23,26,25,26,29,24]
department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']
salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]

values = [tuple([employee_id[i],name[i],age[i],department[i],salary[i]]) for i in range(12)]
print(values)
cur.executemany('Insert into employeeDetail values(?,?,?,?,?)',values)
db.commit()

[(101, 'Aadarsh', 25, 'Marketing', 50000), (102, 'Aarti', 27, 'Operations', 60000), (103, 'Siddharth', 25, 'Finance', 85000), (104, 'Aman', 24, 'Human Resource', 75000), (105, 'Amit', 30, 'Marketing', 50000), (106, 'Shivansh', 26, 'IT', 90000), (107, 'Vaibhav', 23, 'Finance', 85000), (108, 'Himanshu', 26, 'IT', 90000), (109, 'Raman', 25, 'Operations', 60000), (110, 'Kunal', 26, 'Marketing', 50000), (111, 'Adhira', 29, 'Human Resource', 75000), (112, 'Tanya', 24, 'Marketing', 50000)]

### Fetch data

In [20]:
# Way 1
cur.execute('select * from employeeDetail')
for row in cur:
    print(row)

(101, 'Aadarsh', 25, 'Marketing', 50000)
(102, 'Aarti', 27, 'Operations', 60000)
(103, 'Siddharth', 25, 'Finance', 85000)
(104, 'Aman', 24, 'Human Resource', 75000)
(105, 'Amit', 30, 'Marketing', 50000)
(106, 'Shivansh', 26, 'IT', 90000)
(107, 'Vaibhav', 23, 'Finance', 85000)
(108, 'Himanshu', 26, 'IT', 90000)
(109, 'Raman', 25, 'Operations', 60000)
(110, 'Kunal', 26, 'Marketing', 50000)
(111, 'Adhira', 29, 'Human Resource', 75000)
(112, 'Tanya', 24, 'Marketing', 50000)

#### fetchone()
#### fetchmany()
#### fetchall()

In [21]:
cur.execute('select * from employeeDetail')
print(cur.fetchone()) # Row1
print(cur.fetchone()) # Row 2

(101, 'Aadarsh', 25, 'Marketing', 50000)
(102, 'Aarti', 27, 'Operations', 60000)

In [22]:
cur.execute('select * from employeeDetail')
print(cur.fetchmany(5)) # 5 rows

[(101, 'Aadarsh', 25, 'Marketing', 50000), (102, 'Aarti', 27, 'Operations', 60000), (103, 'Siddharth', 25, 'Finance', 85000), (104, 'Aman', 24, 'Human Resource', 75000), (105, 'Amit', 30, 'Marketing', 50000)]

In [23]:
cur.execute('select * from employeeDetail')
ans = cur.fetchall()
print(ans)

[(101, 'Aadarsh', 25, 'Marketing', 50000), (102, 'Aarti', 27, 'Operations', 60000), (103, 'Siddharth', 25, 'Finance', 85000), (104, 'Aman', 24, 'Human Resource', 75000), (105, 'Amit', 30, 'Marketing', 50000), (106, 'Shivansh', 26, 'IT', 90000), (107, 'Vaibhav', 23, 'Finance', 85000), (108, 'Himanshu', 26, 'IT', 90000), (109, 'Raman', 25, 'Operations', 60000), (110, 'Kunal', 26, 'Marketing', 50000), (111, 'Adhira', 29, 'Human Resource', 75000), (112, 'Tanya', 24, 'Marketing', 50000)]

In [24]:
cur.execute('select * from employeeDetail where employeeid>103')
print(cur.fetchmany(5)) # 5 rows

[(104, 'Aman', 24, 'Human Resource', 75000), (105, 'Amit', 30, 'Marketing', 50000), (106, 'Shivansh', 26, 'IT', 90000), (107, 'Vaibhav', 23, 'Finance', 85000), (108, 'Himanshu', 26, 'IT', 90000)]

In [25]:
cur.execute('select * from employeeDetail where name like "A%" ')
print(cur.fetchall())

[(101, 'Aadarsh', 25, 'Marketing', 50000), (102, 'Aarti', 27, 'Operations', 60000), (104, 'Aman', 24, 'Human Resource', 75000), (105, 'Amit', 30, 'Marketing', 50000), (111, 'Adhira', 29, 'Human Resource', 75000)]

### Find the employee_id of employee whose is working in Finance Department in Investment firm from Employee SQLite Database.
### Print the employee_id as integer value

In [26]:
import sqlite3
db = sqlite3.connect('Employee.sqlite')
cur = db.cursor()
cur.execute('select employeeid from employeedetail where department="Finance" ')
for id in cur:
    print(id[0])

103
107

### Find the number of employee working in different department in an investment firm from Employee SQLite Database.
### Print the department and number of employee

In [27]:
cur.execute('select department,count(*) from employeedetail group by department')
res = cur.fetchall()
for r in res:
    print(r)

('Finance', 2)
('Human Resource', 2)
('IT', 2)
('Marketing', 4)
('Operations', 2)

In [28]:
db.close()

###  SQLite with pandas

In [31]:
import pandas as pd
import sqlite3

db = sqlite3.connect('School.sqlite')
data = pd.read_sql_query('Select * from student', db)
data

   RollNumber     Name  Age
0         101     Aman   30
1         102    Mohit   25
2         104   Nikhil   50
3         105    Nidhi   30
4         106  Manisha   30
5         107   Ankush   30

In [34]:
data[data['Age']==30]

   RollNumber     Name  Age
0         101     Aman   30
3         105    Nidhi   30
4         106  Manisha   30
5         107   Ankush   30

In [35]:
df = pd.DataFrame([[201,"Aman","English",2000], [202,"sanjeev","Maths",2200], [203,"Pankaj","Science",2500]], columns=['ID','Name','Vourse','Salary'])
df

    ID     Name   Vourse  Salary
0  201     Aman  English    2000
1  202  sanjeev    Maths    2200
2  203   Pankaj  Science    2500

In [36]:
df.to_sql("Faculty",db)

### Add new column using pandas

In [38]:
df['Address'] = 'Test'
df.to_sql("Faculty", db, if_exists='replace')

In [39]:
db.close()

### IMDB.sqlite' database contains all details of movies and has three tables with name IMDB, genre and earning.
### Find the count of each genre present in IMDB movie dataset?
### Print the Genre and number of movies present in that genre.

In [51]:
import pandas as pd
import sqlite3

db = sqlite3.connect('IMDB.sqlite')
data = pd.read_sql_query('Select genre,count(*) from genre group by genre', db)

for i in range(1,len(data)):# i starts from 1 bcz at 0 genre is empty which we have to ignore
    print(data['genre'].iloc[i], data['count(*)'].iloc[i])

Action 33
Adventure 43
Animation 13
Biography 21
Comedy 31
Crime 11
Drama 77
Family 3
Fantasy 7
History 6
Horror 2
Music 3
Musical 1
Mystery 7
Romance 13
Sci-Fi 18
Sport 3
Thriller 14
War 2
Western 2

### Find the highest-grossing movie (i.e domestic earning + worldwide earning) in IMDB database.
### Print the rating of that movie.

In [70]:
import pandas as pd
import sqlite3

db = sqlite3.connect('IMDB.sqlite')
imdb_df = pd.read_sql_query('Select * from imdb', db)
earning_df = pd.read_sql_query('Select Rating, Domestic, Worldwide from earning join imdb on imdb.Movie_id = earning.Movie_id', db)
earning_df['total_earning'] = earning_df['Domestic'] + earning_df['Worldwide']
highest_grossing_movie = earning_df[earning_df['total_earning'] == earning_df['total_earning'].max()] # From this we get mmovie_id = 38626
highest_grossing_movie_rating = highest_grossing_movie['Rating'].iloc[0]
print(highest_grossing_movie_rating)

8.1